l1ose = int(0)
score = int(0)
sin = 0 #Переменная для выхода с лвл math
san = 0 #Переменная для выхода с лвл geo
syn = 0 #Переменная для выхода с лвл inf
b = 0 #Пропуск о прохождении лвл 1 мат
c = 0 #Пропуск о прохождении лвл 2 мат
d = 0 #Пропуск о прохождении лвл 3 мат
g = 0 #Пропуск о прохождении лвл 1 гео
e = 0 #Пропуск о прохождении лвл 2 гео
h = 0 #Пропуск о прохождении лвл 3 гео
l = 0 #Пропуск о прохождении лвл 1 инф
n = 0 #Пропуск о прохождении лвл 2 инф
m = 0 #Пропуск о прохождении лвл 3 инф


def math():
    global l1ose, score, a, b, sin

while sin != 3:
    print("Выбери сложность")
    print("Если вы выбирали сложность и прошли её выберите другую в ином случае вы выбываете.")
    print("0-Низкая сложность, 1-средняя сложность, 2- высокая сложность")
    a = int(input())
    if a == 0:
        if b != 1:
            print("Отлично давай начнем с низкой сложности!")
            print("Первый вопрос")
            print("Выберите правильный порядрок выполнения действий")
            print("0-(Скобки,умножение/деление,сложение/вычитание), 1-(сложение/вычитание, деление/умнодение, скобки),2-(деление/умножение, скобки, сложение/вычитание)")
            a = int(input())
            if a == 0:
                print("Молодец! Верно")
                score = score + 1
            else:
                print("Не верно в следующий раз повезет")
                print(score)
                l1ose = l1ose + 1
            print("Второй вопрос")
            print("Можно ли делить на 0")
            print("0-да, 1-нет")
            a = int(input())
            if a == 1:
                print("Молодец, верно")
                score = score + 1
            else:
                print("Не в этот раз в другой раз повезет.")
                l1ose = l1ose + 1
            print("Третий вопрос")
            print("Дайте верный ответ на пример 94+46-100/5*(60)")
            a = int(input())
            if a == -1060:
                print("Верно, молодец!")
                score = score = 1
                b = 1
            else:
                l1ose = l1ose + 1
            sin = sin + 1
        else:
            print("Tы проходил этот уровень!")
            print("За попытку обмануть систму вы проиграли викторину!")
            print(score)
            l1ose = l1ose + 1
            exit()
    elif a == 1:
        if c != 1:
            print("Приветствую вас на среднем уровне!")
            print("Первый вопрос- Правда ли, что любое число в 0 степени = 1")
            print("Да-1, Нет-2")
            a = int(input())
            if a == 1:
                print("Молодец.Верно")
                score = score + 1
            else:
                print("Ну нет это неверно")
                l1ose = l1ose + 1
                print(score)
            print("Второй вопрос- Назовите теорему пифагора")
            print("(c2=a2+b2)-1, (Y=x-12)-2")
            a = int(input())
            if a == 1:
                print("Верно!")
                score + score + 1
            else:
                print("Похоже это твой предел")
                l1ose = l1ose + 1
            sin = sin + 1
        else:
            print("Tы проходил этот уровень!")
            print("За попытку обмануть систему вы проиграли викторину!")
            print(score)
            l1ose = l1ose + 1
            exit()
    elif a == 2:
        if d != 1:
            print("Приветсвую тебя на сложном уровне!")
            print("Первый вопрос-что такое функция в математике")
            print("1-зависимость одной переменной от другой, 2-папка, где хранятся данные одного типа, 3-команда в различных языках")
            a = int(input())
            if a == 1:
                print("Верный ответ")
                score = score + 1
            else:
                print("Не вееерно")
                l1ose = l1ose + 1
            print("Второй вопрос-какой график означает функция y=kx+b")
            print("1-парабола,2-гипербола,3-линейная функция")
            a = int(input())
            if a == 3:
                print("Верно")
                score = score + 1
            else:
                print("Не верно")
                l1ose = l1ose + 1
            sin = sin + 1
        else:
            print("Ты пытался обмануть систему за это ты проиграл!")
            print(score)
            l1ose = l1ose + 1
            exit()



def geo():
    global l1ose, score, a, g, e, h, san
    while san != 3:
        print("Приветсвую на предмете история!")
        print("Куда отправимся?")
        print("Древний Египет - 0,Древняя Греция - 1, Древняя Италия - 2")
        a = int(input())
        if a == 0:
            if g != 1:
                print("Вопрос - для кого строили пирамиды и для чего? ")
                print("Для фараонов и захоронения их - 1, Для королей и проживания там - 2, Для всего народа и проживания там - 3")
                a = int(input())
                if a == 1:
                    print("Верно!")
                    score = score + 1
                else:
                    print("Не верно")
                    print(score)
                    l1ose = l1ose + 1
                print("Следующий вопрос - Где находился Древний египет и кто был правителем?")
                print("Северо-запад Африки и правил народ - 1, Северо-восток Африки и правитель был фараон - 2, Центр Евразии и правил президент - 3")
                a = int(input())
                if a == 2:
                    print("Bерно!")
                    score = score + 1
                    g = 1
                else:
                    print("He верно!")
                    l1ose = l1ose + 1
                san = san + 1
            else:
                print("Tы проходил этот уровень!")
                print("За попытку обмануть систму вы проиграли викторину!")
                print(score)
                l1ose = l1ose + 1
                exit()
        elif a == 1:
            if e != 1:
                print("Вопрос - кто-нибудь смог перенять культуру Древней Греции ")
                print("Да, это Великая Римская Империя - 1, Нет - 2, Да, Современная Греция - 3")
                a = int(input())
                if a == 1:
                    print("Верно!")
                    score = score + 1
                else:
                    print("Упс! Ошибся")
                    l1ose = l1ose + 1
                    print(score)
                print("Следующий вопрос - Где находилась Древняя Греция?")
                print("Европа - 1, Северная Африка - 2, Восточная Европа - 3")
                a = int(input())
                if a == 3:
                    print("Верно!")
                    score = score + 1
                    e = 1
                else:
                    print("Неверно!")
                    print(score)
                    l1ose = l1ose + 1
                san = san + 1
            else:
                print("Tы проходил этот уровень!")
                print("За попытку обмануть систму вы проиграли викторину!")
                print(score)
                l1ose = l1ose + 1
                exit()
        elif a == 2:
            if h != 1:
                print("Вопрос - Где зародилась такая страна, как Италия(Великая Римская Империя)?")
                print("Пиренейский полу-остров - 1, Мальдивы - 2, Австралия - 3")
                a = int(input())
                if a == 1:
                    print("Верно!")
                    score = score + 1
                    print("Следующий вопрос - На какие части была поделина Великая Римская Империя?")
                    print("На северную и западную - 1, На северную и южную - 2, Восточную и западную - 3")
                    a = int(input())
                    if a == 3:
                        print("Верно!")
                        score = score + 1
                        h = 1
                    else:
                        print("Нееет! Ты проиграл!")
                        print(score)
                        l1ose = l1ose + 1
                else:
                    print("Неверно!")
                    print(score)
                    l1ose = l1ose + 1
                san = san + 1
            else:
                print("Tы проходил этот уровень!")
                print("За попытку обмануть систему вы проиграли викторину!")
                print(score)
                l1ose = l1ose + 1
                exit()

        else:
            print("Сомневаюсь, что ты после такого выбора решишь вопрос! ")
            print(score)
            l1ose = l1ose + 1
            exit()

def inf():
    global l1ose, score, a, l ,n, m, syn
    while syn != 2:
        print("Приветствую на предмете информатика")
        print("Введите номер вашей сложности 1-легкий 2-нормальный 3-сложный")
        a == int(input())
        if a == 1:
            if l != 1:
                print("Приветсвую тебя на легком уровне!")
                print("Первый вопрос-какой модуль компьтера отвечает за атоматическую загрузку операционной системы")
                print("Варианты ответа 1-видеокарта 2-процессор 3-материнская плата 4-батарейка")
                if a == 4:
                    print("Верно")
                    score = score + 1
                else:
                    print("Неверно")
                    print(score)
                    l1ose = l1ose + 1
                print("Второй вопрос-отчего зависит скорость ВСЕХ выполнения процеесов на компьютере")
                print("1-процессор 2-видеокарта 3-материнская плата 4-от скорости интернета")
                a = int(input())
                if a == 1:
                    print("Молодец, верно!")
                    score =+ 1
                else:
                    print("Не верно")
                    print(score)
                    l1ose =+ 1
                syn =+ 1
            else:
                print("За попытку обмануть сиситему ты проиграл")
                l1ose = l1ose + 1
                print(score)
                exit()
        elif a == 2:
            if n != 1:
                print("Приветствую на среднем уровне!")
                print("Первый вопрос - какие цифры используются в двоичном коде")
                print("1-(1-9), 2-(1-3), 3-(0-1), 4-(1-2)")
                a = int(input())
                if a == 3:
                    print("Верно")
                    score =+ 1
                else:
                    print("НЕ верно")
                    print(score)
                    l1ose =+ 1
                print("Второй вопрос - какой разъем используется для подключения изображения к телевизору ")
                print("1-USB 2-HDMI 3-USB type C 4-любой из перечисленных")
                a = int(input())
                if a == 2:
                    print("Верно")
                    score =+ 1
                else:
                    print("Не верно")
                    print(score)
                    l1ose =+ 1
                syn = syn + 1
        elif a == 3:
            print("")



print("Привет давай сыграем в викторину")
print("1-да 2-нет")
a = int(input("Ваш ответ-"))
if a == 1:
    print("Отлично давай начнем!")
    while l1ose < 1:
        print("Выбор игрока")
        print("Выберите предмет: 0-Математика, 1-история, 2-география, 3-информатика")
        a = int(input())
        if a == 0:
            math()
        elif a == 1:
            geo()
        elif a == 2:
            inf()
        else:
            print("Такого предмета не существует в данном списке")
            exit()


    print("Ты ответил на все вопросы!")
    print("Игра закончена!")
    print("Твой счет - ", score)
elif a == 2:
     print("А зачем начинал?")
     exit()
else:
    print("Ты не понял вопрос?")
    exit()
